docx(README.md):add mermaid diagrams
